"use strict";

var app = angular.module('app', ['ngRoute', 'ngCookies', 'ui.bootstrap', 'firebase']);

//main — главный модуль
//Контроллеры именуются в зависимости от своего расположения: МодульВид[Вложенныевиды]Ctrl

// TODO: Автоматическое добавление файлов в index.html, склейка их в один в app.dist и минификация
// TODO: Валидация форм, система вывода сообщений об ошибках
// TODO: Прелоадеры
// TODO: Загрузка картинок (логотипы, аватарки)
// TODO: Регистрация через соц. сети
// TODO: Разобраться с глюками роутера
// TODO: Остальной функционал

